[Subtitles]
Sage_VO_Intro_01_live_Announcer_1=STOP! excited! No theme!
Sage_VO_Intro_01_live_Announcer_2=It's time for another episode of Treasure Hunters with Lord Hammerlock.!
Sage_VO_Intro_02_live_Announcer_1=In this week's story, our mighty warriors are going to the land of Egilot!
Sage_VO_Intro_02_live_Announcer_2=Your goal? Meet the curious creatures of Pandora and give them a gift or two!
Sage_VO_Intro_03_live_Announcer_1=But our pride and confidence are in trouble.
Sage_VO_Intro_03_live_Announcer_2=Although Handsome Jack is gone, so is his legacy...
Sage_VO_Intro_04_live_Announcer_1=...be forever.
Sage_VO_Intro_Title= 